Revit 2024 API
UnitTypeId.NewtonsPerMeter Property
 Newtons per meter.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2021
Syntax
C#
public static ForgeTypeId NewtonsPerMeter { get; }
Visual Basic
Public Shared ReadOnly Property NewtonsPerMeter As ForgeTypeId
	Get
Visual C++
public:
static property ForgeTypeId^ NewtonsPerMeter {
	ForgeTypeId^ get ();
}
See Also
UnitTypeId Class
Autodesk.Revit.DB Namespace